/// Auto-generated file.
/// See under `tool/generate_spinners.dart`.

import '../spinner_data.dart';

final class CliSpinners {
  /// dots spinner, using the following sequence:
  ///
  /// `⠋, ⠙, ⠹, ⠸, ⠼, ⠴, ⠦, ⠧, ⠇, ⠏`
  static const dots = SpinnerData(
    interval: 80,
    frames: ["⠋", "⠙", "⠹", "⠸", "⠼", "⠴", "⠦", "⠧", "⠇", "⠏"],
  );

  /// dots2 spinner, using the following sequence:
  ///
  /// `⣾, ⣽, ⣻, ⢿, ⡿, ⣟, ⣯, ⣷`
  static const dots2 = SpinnerData(
    interval: 80,
    frames: ["⣾", "⣽", "⣻", "⢿", "⡿", "⣟", "⣯", "⣷"],
  );

  /// dots3 spinner, using the following sequence:
  ///
  /// `⠋, ⠙, ⠚, ⠞, ⠖, ⠦, ⠴, ⠲, ⠳, ⠓`
  static const dots3 = SpinnerData(
    interval: 80,
    frames: ["⠋", "⠙", "⠚", "⠞", "⠖", "⠦", "⠴", "⠲", "⠳", "⠓"],
  );

  /// dots4 spinner, using the following sequence:
  ///
  /// `⠄, ⠆, ⠇, ⠋, ⠙, ⠸, ⠰, ⠠, ⠰, ⠸, ⠙, ⠋, ⠇, ⠆`
  static const dots4 = SpinnerData(
    interval: 80,
    frames: [
      "⠄",
      "⠆",
      "⠇",
      "⠋",
      "⠙",
      "⠸",
      "⠰",
      "⠠",
      "⠰",
      "⠸",
      "⠙",
      "⠋",
      "⠇",
      "⠆"
    ],
  );

  /// dots5 spinner, using the following sequence:
  ///
  /// `⠋, ⠙, ⠚, ⠒, ⠂, ⠂, ⠒, ⠲, ⠴, ⠦, ⠖, ⠒, ⠐, ⠐, ⠒, ⠓, ⠋`
  static const dots5 = SpinnerData(
    interval: 80,
    frames: [
      "⠋",
      "⠙",
      "⠚",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠲",
      "⠴",
      "⠦",
      "⠖",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠓",
      "⠋"
    ],
  );

  /// dots6 spinner, using the following sequence:
  ///
  /// `⠁, ⠉, ⠙, ⠚, ⠒, ⠂, ⠂, ⠒, ⠲, ⠴, ⠤, ⠄, ⠄, ⠤, ⠴, ⠲, ⠒, ⠂, ⠂, ⠒, ⠚, ⠙, ⠉, ⠁`
  static const dots6 = SpinnerData(
    interval: 80,
    frames: [
      "⠁",
      "⠉",
      "⠙",
      "⠚",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠲",
      "⠴",
      "⠤",
      "⠄",
      "⠄",
      "⠤",
      "⠴",
      "⠲",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠚",
      "⠙",
      "⠉",
      "⠁"
    ],
  );

  /// dots7 spinner, using the following sequence:
  ///
  /// `⠈, ⠉, ⠋, ⠓, ⠒, ⠐, ⠐, ⠒, ⠖, ⠦, ⠤, ⠠, ⠠, ⠤, ⠦, ⠖, ⠒, ⠐, ⠐, ⠒, ⠓, ⠋, ⠉, ⠈`
  static const dots7 = SpinnerData(
    interval: 80,
    frames: [
      "⠈",
      "⠉",
      "⠋",
      "⠓",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠖",
      "⠦",
      "⠤",
      "⠠",
      "⠠",
      "⠤",
      "⠦",
      "⠖",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠓",
      "⠋",
      "⠉",
      "⠈"
    ],
  );

  /// dots8 spinner, using the following sequence:
  ///
  /// `⠁, ⠁, ⠉, ⠙, ⠚, ⠒, ⠂, ⠂, ⠒, ⠲, ⠴, ⠤, ⠄, ⠄, ⠤, ⠠, ⠠, ⠤, ⠦, ⠖, ⠒, ⠐, ⠐, ⠒, ⠓, ⠋, ⠉, ⠈, ⠈`
  static const dots8 = SpinnerData(
    interval: 80,
    frames: [
      "⠁",
      "⠁",
      "⠉",
      "⠙",
      "⠚",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠲",
      "⠴",
      "⠤",
      "⠄",
      "⠄",
      "⠤",
      "⠠",
      "⠠",
      "⠤",
      "⠦",
      "⠖",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠓",
      "⠋",
      "⠉",
      "⠈",
      "⠈"
    ],
  );

  /// dots9 spinner, using the following sequence:
  ///
  /// `⢹, ⢺, ⢼, ⣸, ⣇, ⡧, ⡗, ⡏`
  static const dots9 = SpinnerData(
    interval: 80,
    frames: ["⢹", "⢺", "⢼", "⣸", "⣇", "⡧", "⡗", "⡏"],
  );

  /// dots10 spinner, using the following sequence:
  ///
  /// `⢄, ⢂, ⢁, ⡁, ⡈, ⡐, ⡠`
  static const dots10 = SpinnerData(
    interval: 80,
    frames: ["⢄", "⢂", "⢁", "⡁", "⡈", "⡐", "⡠"],
  );

  /// dots11 spinner, using the following sequence:
  ///
  /// `⠁, ⠂, ⠄, ⡀, ⢀, ⠠, ⠐, ⠈`
  static const dots11 = SpinnerData(
    interval: 100,
    frames: ["⠁", "⠂", "⠄", "⡀", "⢀", "⠠", "⠐", "⠈"],
  );

  /// dots12 spinner, using the following sequence:
  ///
  /// `⢀⠀, ⡀⠀, ⠄⠀, ⢂⠀, ⡂⠀, ⠅⠀, ⢃⠀, ⡃⠀, ⠍⠀, ⢋⠀, ⡋⠀, ⠍⠁, ⢋⠁, ⡋⠁, ⠍⠉, ⠋⠉, ⠋⠉, ⠉⠙, ⠉⠙, ⠉⠩, ⠈⢙, ⠈⡙, ⢈⠩, ⡀⢙, ⠄⡙, ⢂⠩, ⡂⢘, ⠅⡘, ⢃⠨, ⡃⢐, ⠍⡐, ⢋⠠, ⡋⢀, ⠍⡁, ⢋⠁, ⡋⠁, ⠍⠉, ⠋⠉, ⠋⠉, ⠉⠙, ⠉⠙, ⠉⠩, ⠈⢙, ⠈⡙, ⠈⠩, ⠀⢙, ⠀⡙, ⠀⠩, ⠀⢘, ⠀⡘, ⠀⠨, ⠀⢐, ⠀⡐, ⠀⠠, ⠀⢀, ⠀⡀`
  static const dots12 = SpinnerData(
    interval: 80,
    frames: [
      "⢀⠀",
      "⡀⠀",
      "⠄⠀",
      "⢂⠀",
      "⡂⠀",
      "⠅⠀",
      "⢃⠀",
      "⡃⠀",
      "⠍⠀",
      "⢋⠀",
      "⡋⠀",
      "⠍⠁",
      "⢋⠁",
      "⡋⠁",
      "⠍⠉",
      "⠋⠉",
      "⠋⠉",
      "⠉⠙",
      "⠉⠙",
      "⠉⠩",
      "⠈⢙",
      "⠈⡙",
      "⢈⠩",
      "⡀⢙",
      "⠄⡙",
      "⢂⠩",
      "⡂⢘",
      "⠅⡘",
      "⢃⠨",
      "⡃⢐",
      "⠍⡐",
      "⢋⠠",
      "⡋⢀",
      "⠍⡁",
      "⢋⠁",
      "⡋⠁",
      "⠍⠉",
      "⠋⠉",
      "⠋⠉",
      "⠉⠙",
      "⠉⠙",
      "⠉⠩",
      "⠈⢙",
      "⠈⡙",
      "⠈⠩",
      "⠀⢙",
      "⠀⡙",
      "⠀⠩",
      "⠀⢘",
      "⠀⡘",
      "⠀⠨",
      "⠀⢐",
      "⠀⡐",
      "⠀⠠",
      "⠀⢀",
      "⠀⡀"
    ],
  );

  /// dots13 spinner, using the following sequence:
  ///
  /// `⣼, ⣹, ⢻, ⠿, ⡟, ⣏, ⣧, ⣶`
  static const dots13 = SpinnerData(
    interval: 80,
    frames: ["⣼", "⣹", "⢻", "⠿", "⡟", "⣏", "⣧", "⣶"],
  );

  /// dots8Bit spinner, using the following sequence:
  ///
  /// `⠀, ⠁, ⠂, ⠃, ⠄, ⠅, ⠆, ⠇, ⡀, ⡁, ⡂, ⡃, ⡄, ⡅, ⡆, ⡇, ⠈, ⠉, ⠊, ⠋, ⠌, ⠍, ⠎, ⠏, ⡈, ⡉, ⡊, ⡋, ⡌, ⡍, ⡎, ⡏, ⠐, ⠑, ⠒, ⠓, ⠔, ⠕, ⠖, ⠗, ⡐, ⡑, ⡒, ⡓, ⡔, ⡕, ⡖, ⡗, ⠘, ⠙, ⠚, ⠛, ⠜, ⠝, ⠞, ⠟, ⡘, ⡙, ⡚, ⡛, ⡜, ⡝, ⡞, ⡟, ⠠, ⠡, ⠢, ⠣, ⠤, ⠥, ⠦, ⠧, ⡠, ⡡, ⡢, ⡣, ⡤, ⡥, ⡦, ⡧, ⠨, ⠩, ⠪, ⠫, ⠬, ⠭, ⠮, ⠯, ⡨, ⡩, ⡪, ⡫, ⡬, ⡭, ⡮, ⡯, ⠰, ⠱, ⠲, ⠳, ⠴, ⠵, ⠶, ⠷, ⡰, ⡱, ⡲, ⡳, ⡴, ⡵, ⡶, ⡷, ⠸, ⠹, ⠺, ⠻, ⠼, ⠽, ⠾, ⠿, ⡸, ⡹, ⡺, ⡻, ⡼, ⡽, ⡾, ⡿, ⢀, ⢁, ⢂, ⢃, ⢄, ⢅, ⢆, ⢇, ⣀, ⣁, ⣂, ⣃, ⣄, ⣅, ⣆, ⣇, ⢈, ⢉, ⢊, ⢋, ⢌, ⢍, ⢎, ⢏, ⣈, ⣉, ⣊, ⣋, ⣌, ⣍, ⣎, ⣏, ⢐, ⢑, ⢒, ⢓, ⢔, ⢕, ⢖, ⢗, ⣐, ⣑, ⣒, ⣓, ⣔, ⣕, ⣖, ⣗, ⢘, ⢙, ⢚, ⢛, ⢜, ⢝, ⢞, ⢟, ⣘, ⣙, ⣚, ⣛, ⣜, ⣝, ⣞, ⣟, ⢠, ⢡, ⢢, ⢣, ⢤, ⢥, ⢦, ⢧, ⣠, ⣡, ⣢, ⣣, ⣤, ⣥, ⣦, ⣧, ⢨, ⢩, ⢪, ⢫, ⢬, ⢭, ⢮, ⢯, ⣨, ⣩, ⣪, ⣫, ⣬, ⣭, ⣮, ⣯, ⢰, ⢱, ⢲, ⢳, ⢴, ⢵, ⢶, ⢷, ⣰, ⣱, ⣲, ⣳, ⣴, ⣵, ⣶, ⣷, ⢸, ⢹, ⢺, ⢻, ⢼, ⢽, ⢾, ⢿, ⣸, ⣹, ⣺, ⣻, ⣼, ⣽, ⣾, ⣿`
  static const dots8Bit = SpinnerData(
    interval: 80,
    frames: [
      "⠀",
      "⠁",
      "⠂",
      "⠃",
      "⠄",
      "⠅",
      "⠆",
      "⠇",
      "⡀",
      "⡁",
      "⡂",
      "⡃",
      "⡄",
      "⡅",
      "⡆",
      "⡇",
      "⠈",
      "⠉",
      "⠊",
      "⠋",
      "⠌",
      "⠍",
      "⠎",
      "⠏",
      "⡈",
      "⡉",
      "⡊",
      "⡋",
      "⡌",
      "⡍",
      "⡎",
      "⡏",
      "⠐",
      "⠑",
      "⠒",
      "⠓",
      "⠔",
      "⠕",
      "⠖",
      "⠗",
      "⡐",
      "⡑",
      "⡒",
      "⡓",
      "⡔",
      "⡕",
      "⡖",
      "⡗",
      "⠘",
      "⠙",
      "⠚",
      "⠛",
      "⠜",
      "⠝",
      "⠞",
      "⠟",
      "⡘",
      "⡙",
      "⡚",
      "⡛",
      "⡜",
      "⡝",
      "⡞",
      "⡟",
      "⠠",
      "⠡",
      "⠢",
      "⠣",
      "⠤",
      "⠥",
      "⠦",
      "⠧",
      "⡠",
      "⡡",
      "⡢",
      "⡣",
      "⡤",
      "⡥",
      "⡦",
      "⡧",
      "⠨",
      "⠩",
      "⠪",
      "⠫",
      "⠬",
      "⠭",
      "⠮",
      "⠯",
      "⡨",
      "⡩",
      "⡪",
      "⡫",
      "⡬",
      "⡭",
      "⡮",
      "⡯",
      "⠰",
      "⠱",
      "⠲",
      "⠳",
      "⠴",
      "⠵",
      "⠶",
      "⠷",
      "⡰",
      "⡱",
      "⡲",
      "⡳",
      "⡴",
      "⡵",
      "⡶",
      "⡷",
      "⠸",
      "⠹",
      "⠺",
      "⠻",
      "⠼",
      "⠽",
      "⠾",
      "⠿",
      "⡸",
      "⡹",
      "⡺",
      "⡻",
      "⡼",
      "⡽",
      "⡾",
      "⡿",
      "⢀",
      "⢁",
      "⢂",
      "⢃",
      "⢄",
      "⢅",
      "⢆",
      "⢇",
      "⣀",
      "⣁",
      "⣂",
      "⣃",
      "⣄",
      "⣅",
      "⣆",
      "⣇",
      "⢈",
      "⢉",
      "⢊",
      "⢋",
      "⢌",
      "⢍",
      "⢎",
      "⢏",
      "⣈",
      "⣉",
      "⣊",
      "⣋",
      "⣌",
      "⣍",
      "⣎",
      "⣏",
      "⢐",
      "⢑",
      "⢒",
      "⢓",
      "⢔",
      "⢕",
      "⢖",
      "⢗",
      "⣐",
      "⣑",
      "⣒",
      "⣓",
      "⣔",
      "⣕",
      "⣖",
      "⣗",
      "⢘",
      "⢙",
      "⢚",
      "⢛",
      "⢜",
      "⢝",
      "⢞",
      "⢟",
      "⣘",
      "⣙",
      "⣚",
      "⣛",
      "⣜",
      "⣝",
      "⣞",
      "⣟",
      "⢠",
      "⢡",
      "⢢",
      "⢣",
      "⢤",
      "⢥",
      "⢦",
      "⢧",
      "⣠",
      "⣡",
      "⣢",
      "⣣",
      "⣤",
      "⣥",
      "⣦",
      "⣧",
      "⢨",
      "⢩",
      "⢪",
      "⢫",
      "⢬",
      "⢭",
      "⢮",
      "⢯",
      "⣨",
      "⣩",
      "⣪",
      "⣫",
      "⣬",
      "⣭",
      "⣮",
      "⣯",
      "⢰",
      "⢱",
      "⢲",
      "⢳",
      "⢴",
      "⢵",
      "⢶",
      "⢷",
      "⣰",
      "⣱",
      "⣲",
      "⣳",
      "⣴",
      "⣵",
      "⣶",
      "⣷",
      "⢸",
      "⢹",
      "⢺",
      "⢻",
      "⢼",
      "⢽",
      "⢾",
      "⢿",
      "⣸",
      "⣹",
      "⣺",
      "⣻",
      "⣼",
      "⣽",
      "⣾",
      "⣿"
    ],
  );

  /// sand spinner, using the following sequence:
  ///
  /// `⠁, ⠂, ⠄, ⡀, ⡈, ⡐, ⡠, ⣀, ⣁, ⣂, ⣄, ⣌, ⣔, ⣤, ⣥, ⣦, ⣮, ⣶, ⣷, ⣿, ⡿, ⠿, ⢟, ⠟, ⡛, ⠛, ⠫, ⢋, ⠋, ⠍, ⡉, ⠉, ⠑, ⠡, ⢁`
  static const sand = SpinnerData(
    interval: 80,
    frames: [
      "⠁",
      "⠂",
      "⠄",
      "⡀",
      "⡈",
      "⡐",
      "⡠",
      "⣀",
      "⣁",
      "⣂",
      "⣄",
      "⣌",
      "⣔",
      "⣤",
      "⣥",
      "⣦",
      "⣮",
      "⣶",
      "⣷",
      "⣿",
      "⡿",
      "⠿",
      "⢟",
      "⠟",
      "⡛",
      "⠛",
      "⠫",
      "⢋",
      "⠋",
      "⠍",
      "⡉",
      "⠉",
      "⠑",
      "⠡",
      "⢁"
    ],
  );

  /// line spinner, using the following sequence:
  ///
  /// `-, \, |, /`
  static const line = SpinnerData(
    interval: 130,
    frames: ["-", "\\", "|", "/"],
  );

  /// line2 spinner, using the following sequence:
  ///
  /// `⠂, -, –, —, –, -`
  static const line2 = SpinnerData(
    interval: 100,
    frames: ["⠂", "-", "–", "—", "–", "-"],
  );

  /// pipe spinner, using the following sequence:
  ///
  /// `┤, ┘, ┴, └, ├, ┌, ┬, ┐`
  static const pipe = SpinnerData(
    interval: 100,
    frames: ["┤", "┘", "┴", "└", "├", "┌", "┬", "┐"],
  );

  /// simpleDots spinner, using the following sequence:
  ///
  /// `.  , .. , ...,    `
  static const simpleDots = SpinnerData(
    interval: 400,
    frames: [".  ", ".. ", "...", "   "],
  );

  /// simpleDotsScrolling spinner, using the following sequence:
  ///
  /// `.  , .. , ...,  ..,   .,    `
  static const simpleDotsScrolling = SpinnerData(
    interval: 200,
    frames: [".  ", ".. ", "...", " ..", "  .", "   "],
  );

  /// star spinner, using the following sequence:
  ///
  /// `✶, ✸, ✹, ✺, ✹, ✷`
  static const star = SpinnerData(
    interval: 70,
    frames: ["✶", "✸", "✹", "✺", "✹", "✷"],
  );

  /// star2 spinner, using the following sequence:
  ///
  /// `+, x, *`
  static const star2 = SpinnerData(
    interval: 80,
    frames: ["+", "x", "*"],
  );

  /// flip spinner, using the following sequence:
  ///
  /// `_, _, _, -, `, `, ', ´, -, _, _, _`
  static const flip = SpinnerData(
    interval: 70,
    frames: ["_", "_", "_", "-", "`", "`", "'", "´", "-", "_", "_", "_"],
  );

  /// hamburger spinner, using the following sequence:
  ///
  /// `☱, ☲, ☴`
  static const hamburger = SpinnerData(
    interval: 100,
    frames: ["☱", "☲", "☴"],
  );

  /// growVertical spinner, using the following sequence:
  ///
  /// `▁, ▃, ▄, ▅, ▆, ▇, ▆, ▅, ▄, ▃`
  static const growVertical = SpinnerData(
    interval: 120,
    frames: ["▁", "▃", "▄", "▅", "▆", "▇", "▆", "▅", "▄", "▃"],
  );

  /// growHorizontal spinner, using the following sequence:
  ///
  /// `▏, ▎, ▍, ▌, ▋, ▊, ▉, ▊, ▋, ▌, ▍, ▎`
  static const growHorizontal = SpinnerData(
    interval: 120,
    frames: ["▏", "▎", "▍", "▌", "▋", "▊", "▉", "▊", "▋", "▌", "▍", "▎"],
  );

  /// balloon spinner, using the following sequence:
  ///
  /// ` , ., o, O, @, *,  `
  static const balloon = SpinnerData(
    interval: 140,
    frames: [" ", ".", "o", "O", "@", "*", " "],
  );

  /// balloon2 spinner, using the following sequence:
  ///
  /// `., o, O, °, O, o, .`
  static const balloon2 = SpinnerData(
    interval: 120,
    frames: [".", "o", "O", "°", "O", "o", "."],
  );

  /// noise spinner, using the following sequence:
  ///
  /// `▓, ▒, ░`
  static const noise = SpinnerData(
    interval: 100,
    frames: ["▓", "▒", "░"],
  );

  /// bounce spinner, using the following sequence:
  ///
  /// `⠁, ⠂, ⠄, ⠂`
  static const bounce = SpinnerData(
    interval: 120,
    frames: ["⠁", "⠂", "⠄", "⠂"],
  );

  /// boxBounce spinner, using the following sequence:
  ///
  /// `▖, ▘, ▝, ▗`
  static const boxBounce = SpinnerData(
    interval: 120,
    frames: ["▖", "▘", "▝", "▗"],
  );

  /// boxBounce2 spinner, using the following sequence:
  ///
  /// `▌, ▀, ▐, ▄`
  static const boxBounce2 = SpinnerData(
    interval: 100,
    frames: ["▌", "▀", "▐", "▄"],
  );

  /// triangle spinner, using the following sequence:
  ///
  /// `◢, ◣, ◤, ◥`
  static const triangle = SpinnerData(
    interval: 50,
    frames: ["◢", "◣", "◤", "◥"],
  );

  /// binary spinner, using the following sequence:
  ///
  /// `010010, 001100, 100101, 111010, 111101, 010111, 101011, 111000, 110011, 110101`
  static const binary = SpinnerData(
    interval: 80,
    frames: [
      "010010",
      "001100",
      "100101",
      "111010",
      "111101",
      "010111",
      "101011",
      "111000",
      "110011",
      "110101"
    ],
  );

  /// arc spinner, using the following sequence:
  ///
  /// `◜, ◠, ◝, ◞, ◡, ◟`
  static const arc = SpinnerData(
    interval: 100,
    frames: ["◜", "◠", "◝", "◞", "◡", "◟"],
  );

  /// circle spinner, using the following sequence:
  ///
  /// `◡, ⊙, ◠`
  static const circle = SpinnerData(
    interval: 120,
    frames: ["◡", "⊙", "◠"],
  );

  /// squareCorners spinner, using the following sequence:
  ///
  /// `◰, ◳, ◲, ◱`
  static const squareCorners = SpinnerData(
    interval: 180,
    frames: ["◰", "◳", "◲", "◱"],
  );

  /// circleQuarters spinner, using the following sequence:
  ///
  /// `◴, ◷, ◶, ◵`
  static const circleQuarters = SpinnerData(
    interval: 120,
    frames: ["◴", "◷", "◶", "◵"],
  );

  /// circleHalves spinner, using the following sequence:
  ///
  /// `◐, ◓, ◑, ◒`
  static const circleHalves = SpinnerData(
    interval: 50,
    frames: ["◐", "◓", "◑", "◒"],
  );

  /// squish spinner, using the following sequence:
  ///
  /// `╫, ╪`
  static const squish = SpinnerData(
    interval: 100,
    frames: ["╫", "╪"],
  );

  /// toggle spinner, using the following sequence:
  ///
  /// `⊶, ⊷`
  static const toggle = SpinnerData(
    interval: 250,
    frames: ["⊶", "⊷"],
  );

  /// toggle2 spinner, using the following sequence:
  ///
  /// `▫, ▪`
  static const toggle2 = SpinnerData(
    interval: 80,
    frames: ["▫", "▪"],
  );

  /// toggle3 spinner, using the following sequence:
  ///
  /// `□, ■`
  static const toggle3 = SpinnerData(
    interval: 120,
    frames: ["□", "■"],
  );

  /// toggle4 spinner, using the following sequence:
  ///
  /// `■, □, ▪, ▫`
  static const toggle4 = SpinnerData(
    interval: 100,
    frames: ["■", "□", "▪", "▫"],
  );

  /// toggle5 spinner, using the following sequence:
  ///
  /// `▮, ▯`
  static const toggle5 = SpinnerData(
    interval: 100,
    frames: ["▮", "▯"],
  );

  /// toggle6 spinner, using the following sequence:
  ///
  /// `ဝ, ၀`
  static const toggle6 = SpinnerData(
    interval: 300,
    frames: ["ဝ", "၀"],
  );

  /// toggle7 spinner, using the following sequence:
  ///
  /// `⦾, ⦿`
  static const toggle7 = SpinnerData(
    interval: 80,
    frames: ["⦾", "⦿"],
  );

  /// toggle8 spinner, using the following sequence:
  ///
  /// `◍, ◌`
  static const toggle8 = SpinnerData(
    interval: 100,
    frames: ["◍", "◌"],
  );

  /// toggle9 spinner, using the following sequence:
  ///
  /// `◉, ◎`
  static const toggle9 = SpinnerData(
    interval: 100,
    frames: ["◉", "◎"],
  );

  /// toggle10 spinner, using the following sequence:
  ///
  /// `㊂, ㊀, ㊁`
  static const toggle10 = SpinnerData(
    interval: 100,
    frames: ["㊂", "㊀", "㊁"],
  );

  /// toggle11 spinner, using the following sequence:
  ///
  /// `⧇, ⧆`
  static const toggle11 = SpinnerData(
    interval: 50,
    frames: ["⧇", "⧆"],
  );

  /// toggle12 spinner, using the following sequence:
  ///
  /// `☗, ☖`
  static const toggle12 = SpinnerData(
    interval: 120,
    frames: ["☗", "☖"],
  );

  /// toggle13 spinner, using the following sequence:
  ///
  /// `=, *, -`
  static const toggle13 = SpinnerData(
    interval: 80,
    frames: ["=", "*", "-"],
  );

  /// arrow spinner, using the following sequence:
  ///
  /// `←, ↖, ↑, ↗, →, ↘, ↓, ↙`
  static const arrow = SpinnerData(
    interval: 100,
    frames: ["←", "↖", "↑", "↗", "→", "↘", "↓", "↙"],
  );

  /// arrow2 spinner, using the following sequence:
  ///
  /// `⬆️ , ↗️ , ➡️ , ↘️ , ⬇️ , ↙️ , ⬅️ , ↖️ `
  static const arrow2 = SpinnerData(
    interval: 80,
    frames: ["⬆️ ", "↗️ ", "➡️ ", "↘️ ", "⬇️ ", "↙️ ", "⬅️ ", "↖️ "],
  );

  /// arrow3 spinner, using the following sequence:
  ///
  /// `▹▹▹▹▹, ▸▹▹▹▹, ▹▸▹▹▹, ▹▹▸▹▹, ▹▹▹▸▹, ▹▹▹▹▸`
  static const arrow3 = SpinnerData(
    interval: 120,
    frames: ["▹▹▹▹▹", "▸▹▹▹▹", "▹▸▹▹▹", "▹▹▸▹▹", "▹▹▹▸▹", "▹▹▹▹▸"],
  );

  /// bouncingBar spinner, using the following sequence:
  ///
  /// `[    ], [=   ], [==  ], [=== ], [====], [ ===], [  ==], [   =], [    ], [   =], [  ==], [ ===], [====], [=== ], [==  ], [=   ]`
  static const bouncingBar = SpinnerData(
    interval: 80,
    frames: [
      "[    ]",
      "[=   ]",
      "[==  ]",
      "[=== ]",
      "[====]",
      "[ ===]",
      "[  ==]",
      "[   =]",
      "[    ]",
      "[   =]",
      "[  ==]",
      "[ ===]",
      "[====]",
      "[=== ]",
      "[==  ]",
      "[=   ]"
    ],
  );

  /// bouncingBall spinner, using the following sequence:
  ///
  /// `( ●    ), (  ●   ), (   ●  ), (    ● ), (     ●), (    ● ), (   ●  ), (  ●   ), ( ●    ), (●     )`
  static const bouncingBall = SpinnerData(
    interval: 80,
    frames: [
      "( ●    )",
      "(  ●   )",
      "(   ●  )",
      "(    ● )",
      "(     ●)",
      "(    ● )",
      "(   ●  )",
      "(  ●   )",
      "( ●    )",
      "(●     )"
    ],
  );

  /// smiley spinner, using the following sequence:
  ///
  /// `😄 , 😝 `
  static const smiley = SpinnerData(
    interval: 200,
    frames: ["😄 ", "😝 "],
  );

  /// monkey spinner, using the following sequence:
  ///
  /// `🙈 , 🙈 , 🙉 , 🙊 `
  static const monkey = SpinnerData(
    interval: 300,
    frames: ["🙈 ", "🙈 ", "🙉 ", "🙊 "],
  );

  /// hearts spinner, using the following sequence:
  ///
  /// `💛 , 💙 , 💜 , 💚 , ❤️ `
  static const hearts = SpinnerData(
    interval: 100,
    frames: ["💛 ", "💙 ", "💜 ", "💚 ", "❤️ "],
  );

  /// clock spinner, using the following sequence:
  ///
  /// `🕛 , 🕐 , 🕑 , 🕒 , 🕓 , 🕔 , 🕕 , 🕖 , 🕗 , 🕘 , 🕙 , 🕚 `
  static const clock = SpinnerData(
    interval: 100,
    frames: [
      "🕛 ",
      "🕐 ",
      "🕑 ",
      "🕒 ",
      "🕓 ",
      "🕔 ",
      "🕕 ",
      "🕖 ",
      "🕗 ",
      "🕘 ",
      "🕙 ",
      "🕚 "
    ],
  );

  /// earth spinner, using the following sequence:
  ///
  /// `🌍 , 🌎 , 🌏 `
  static const earth = SpinnerData(
    interval: 180,
    frames: ["🌍 ", "🌎 ", "🌏 "],
  );

  /// material spinner, using the following sequence:
  ///
  /// `█▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ███▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ████▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ███████▁▁▁▁▁▁▁▁▁▁▁▁▁, ████████▁▁▁▁▁▁▁▁▁▁▁▁, █████████▁▁▁▁▁▁▁▁▁▁▁, █████████▁▁▁▁▁▁▁▁▁▁▁, ██████████▁▁▁▁▁▁▁▁▁▁, ███████████▁▁▁▁▁▁▁▁▁, █████████████▁▁▁▁▁▁▁, ██████████████▁▁▁▁▁▁, ██████████████▁▁▁▁▁▁, ▁██████████████▁▁▁▁▁, ▁██████████████▁▁▁▁▁, ▁██████████████▁▁▁▁▁, ▁▁██████████████▁▁▁▁, ▁▁▁██████████████▁▁▁, ▁▁▁▁█████████████▁▁▁, ▁▁▁▁██████████████▁▁, ▁▁▁▁██████████████▁▁, ▁▁▁▁▁██████████████▁, ▁▁▁▁▁██████████████▁, ▁▁▁▁▁██████████████▁, ▁▁▁▁▁▁██████████████, ▁▁▁▁▁▁██████████████, ▁▁▁▁▁▁▁█████████████, ▁▁▁▁▁▁▁█████████████, ▁▁▁▁▁▁▁▁████████████, ▁▁▁▁▁▁▁▁████████████, ▁▁▁▁▁▁▁▁▁███████████, ▁▁▁▁▁▁▁▁▁███████████, ▁▁▁▁▁▁▁▁▁▁██████████, ▁▁▁▁▁▁▁▁▁▁██████████, ▁▁▁▁▁▁▁▁▁▁▁▁████████, ▁▁▁▁▁▁▁▁▁▁▁▁▁███████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁██████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████, █▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████, ██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███, ██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███, ███▁▁▁▁▁▁▁▁▁▁▁▁▁▁███, ████▁▁▁▁▁▁▁▁▁▁▁▁▁▁██, █████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█, █████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█, ██████▁▁▁▁▁▁▁▁▁▁▁▁▁█, ████████▁▁▁▁▁▁▁▁▁▁▁▁, █████████▁▁▁▁▁▁▁▁▁▁▁, █████████▁▁▁▁▁▁▁▁▁▁▁, █████████▁▁▁▁▁▁▁▁▁▁▁, █████████▁▁▁▁▁▁▁▁▁▁▁, ███████████▁▁▁▁▁▁▁▁▁, ████████████▁▁▁▁▁▁▁▁, ████████████▁▁▁▁▁▁▁▁, ██████████████▁▁▁▁▁▁, ██████████████▁▁▁▁▁▁, ▁██████████████▁▁▁▁▁, ▁██████████████▁▁▁▁▁, ▁▁▁█████████████▁▁▁▁, ▁▁▁▁▁████████████▁▁▁, ▁▁▁▁▁████████████▁▁▁, ▁▁▁▁▁▁███████████▁▁▁, ▁▁▁▁▁▁▁▁█████████▁▁▁, ▁▁▁▁▁▁▁▁█████████▁▁▁, ▁▁▁▁▁▁▁▁▁█████████▁▁, ▁▁▁▁▁▁▁▁▁█████████▁▁, ▁▁▁▁▁▁▁▁▁▁█████████▁, ▁▁▁▁▁▁▁▁▁▁▁████████▁, ▁▁▁▁▁▁▁▁▁▁▁████████▁, ▁▁▁▁▁▁▁▁▁▁▁▁███████▁, ▁▁▁▁▁▁▁▁▁▁▁▁███████▁, ▁▁▁▁▁▁▁▁▁▁▁▁▁███████, ▁▁▁▁▁▁▁▁▁▁▁▁▁███████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁, ▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁`
  static const material = SpinnerData(
    interval: 17,
    frames: [
      "█▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "███▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "████▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "███████▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "████████▁▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "██████████▁▁▁▁▁▁▁▁▁▁",
      "███████████▁▁▁▁▁▁▁▁▁",
      "█████████████▁▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁▁██████████████▁▁▁▁",
      "▁▁▁██████████████▁▁▁",
      "▁▁▁▁█████████████▁▁▁",
      "▁▁▁▁██████████████▁▁",
      "▁▁▁▁██████████████▁▁",
      "▁▁▁▁▁██████████████▁",
      "▁▁▁▁▁██████████████▁",
      "▁▁▁▁▁██████████████▁",
      "▁▁▁▁▁▁██████████████",
      "▁▁▁▁▁▁██████████████",
      "▁▁▁▁▁▁▁█████████████",
      "▁▁▁▁▁▁▁█████████████",
      "▁▁▁▁▁▁▁▁████████████",
      "▁▁▁▁▁▁▁▁████████████",
      "▁▁▁▁▁▁▁▁▁███████████",
      "▁▁▁▁▁▁▁▁▁███████████",
      "▁▁▁▁▁▁▁▁▁▁██████████",
      "▁▁▁▁▁▁▁▁▁▁██████████",
      "▁▁▁▁▁▁▁▁▁▁▁▁████████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁██████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
      "█▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "███▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "████▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "█████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "█████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "██████▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "████████▁▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "███████████▁▁▁▁▁▁▁▁▁",
      "████████████▁▁▁▁▁▁▁▁",
      "████████████▁▁▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁▁▁█████████████▁▁▁▁",
      "▁▁▁▁▁████████████▁▁▁",
      "▁▁▁▁▁████████████▁▁▁",
      "▁▁▁▁▁▁███████████▁▁▁",
      "▁▁▁▁▁▁▁▁█████████▁▁▁",
      "▁▁▁▁▁▁▁▁█████████▁▁▁",
      "▁▁▁▁▁▁▁▁▁█████████▁▁",
      "▁▁▁▁▁▁▁▁▁█████████▁▁",
      "▁▁▁▁▁▁▁▁▁▁█████████▁",
      "▁▁▁▁▁▁▁▁▁▁▁████████▁",
      "▁▁▁▁▁▁▁▁▁▁▁████████▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁███████▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁███████▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁"
    ],
  );

  /// moon spinner, using the following sequence:
  ///
  /// `🌑 , 🌒 , 🌓 , 🌔 , 🌕 , 🌖 , 🌗 , 🌘 `
  static const moon = SpinnerData(
    interval: 80,
    frames: ["🌑 ", "🌒 ", "🌓 ", "🌔 ", "🌕 ", "🌖 ", "🌗 ", "🌘 "],
  );

  /// runner spinner, using the following sequence:
  ///
  /// `🚶 , 🏃 `
  static const runner = SpinnerData(
    interval: 140,
    frames: ["🚶 ", "🏃 "],
  );

  /// pong spinner, using the following sequence:
  ///
  /// `▐⠂       ▌, ▐⠈       ▌, ▐ ⠂      ▌, ▐ ⠠      ▌, ▐  ⡀     ▌, ▐  ⠠     ▌, ▐   ⠂    ▌, ▐   ⠈    ▌, ▐    ⠂   ▌, ▐    ⠠   ▌, ▐     ⡀  ▌, ▐     ⠠  ▌, ▐      ⠂ ▌, ▐      ⠈ ▌, ▐       ⠂▌, ▐       ⠠▌, ▐       ⡀▌, ▐      ⠠ ▌, ▐      ⠂ ▌, ▐     ⠈  ▌, ▐     ⠂  ▌, ▐    ⠠   ▌, ▐    ⡀   ▌, ▐   ⠠    ▌, ▐   ⠂    ▌, ▐  ⠈     ▌, ▐  ⠂     ▌, ▐ ⠠      ▌, ▐ ⡀      ▌, ▐⠠       ▌`
  static const pong = SpinnerData(
    interval: 80,
    frames: [
      "▐⠂       ▌",
      "▐⠈       ▌",
      "▐ ⠂      ▌",
      "▐ ⠠      ▌",
      "▐  ⡀     ▌",
      "▐  ⠠     ▌",
      "▐   ⠂    ▌",
      "▐   ⠈    ▌",
      "▐    ⠂   ▌",
      "▐    ⠠   ▌",
      "▐     ⡀  ▌",
      "▐     ⠠  ▌",
      "▐      ⠂ ▌",
      "▐      ⠈ ▌",
      "▐       ⠂▌",
      "▐       ⠠▌",
      "▐       ⡀▌",
      "▐      ⠠ ▌",
      "▐      ⠂ ▌",
      "▐     ⠈  ▌",
      "▐     ⠂  ▌",
      "▐    ⠠   ▌",
      "▐    ⡀   ▌",
      "▐   ⠠    ▌",
      "▐   ⠂    ▌",
      "▐  ⠈     ▌",
      "▐  ⠂     ▌",
      "▐ ⠠      ▌",
      "▐ ⡀      ▌",
      "▐⠠       ▌"
    ],
  );

  /// shark spinner, using the following sequence:
  ///
  /// `▐|\____________▌, ▐_|\___________▌, ▐__|\__________▌, ▐___|\_________▌, ▐____|\________▌, ▐_____|\_______▌, ▐______|\______▌, ▐_______|\_____▌, ▐________|\____▌, ▐_________|\___▌, ▐__________|\__▌, ▐___________|\_▌, ▐____________|\▌, ▐____________/|▌, ▐___________/|_▌, ▐__________/|__▌, ▐_________/|___▌, ▐________/|____▌, ▐_______/|_____▌, ▐______/|______▌, ▐_____/|_______▌, ▐____/|________▌, ▐___/|_________▌, ▐__/|__________▌, ▐_/|___________▌, ▐/|____________▌`
  static const shark = SpinnerData(
    interval: 120,
    frames: [
      "▐|\\____________▌",
      "▐_|\\___________▌",
      "▐__|\\__________▌",
      "▐___|\\_________▌",
      "▐____|\\________▌",
      "▐_____|\\_______▌",
      "▐______|\\______▌",
      "▐_______|\\_____▌",
      "▐________|\\____▌",
      "▐_________|\\___▌",
      "▐__________|\\__▌",
      "▐___________|\\_▌",
      "▐____________|\\▌",
      "▐____________/|▌",
      "▐___________/|_▌",
      "▐__________/|__▌",
      "▐_________/|___▌",
      "▐________/|____▌",
      "▐_______/|_____▌",
      "▐______/|______▌",
      "▐_____/|_______▌",
      "▐____/|________▌",
      "▐___/|_________▌",
      "▐__/|__________▌",
      "▐_/|___________▌",
      "▐/|____________▌"
    ],
  );

  /// dqpb spinner, using the following sequence:
  ///
  /// `d, q, p, b`
  static const dqpb = SpinnerData(
    interval: 100,
    frames: ["d", "q", "p", "b"],
  );

  /// weather spinner, using the following sequence:
  ///
  /// `☀️ , ☀️ , ☀️ , 🌤 , ⛅️ , 🌥 , ☁️ , 🌧 , 🌨 , 🌧 , 🌨 , 🌧 , 🌨 , ⛈ , 🌨 , 🌧 , 🌨 , ☁️ , 🌥 , ⛅️ , 🌤 , ☀️ , ☀️ `
  static const weather = SpinnerData(
    interval: 100,
    frames: [
      "☀️ ",
      "☀️ ",
      "☀️ ",
      "🌤 ",
      "⛅️ ",
      "🌥 ",
      "☁️ ",
      "🌧 ",
      "🌨 ",
      "🌧 ",
      "🌨 ",
      "🌧 ",
      "🌨 ",
      "⛈ ",
      "🌨 ",
      "🌧 ",
      "🌨 ",
      "☁️ ",
      "🌥 ",
      "⛅️ ",
      "🌤 ",
      "☀️ ",
      "☀️ "
    ],
  );

  /// christmas spinner, using the following sequence:
  ///
  /// `🌲, 🎄`
  static const christmas = SpinnerData(
    interval: 400,
    frames: ["🌲", "🎄"],
  );

  /// grenade spinner, using the following sequence:
  ///
  /// `،  , ′  ,  ´ ,  ‾ ,   ⸌,   ⸊,   |,   ⁎,   ⁕,  ෴ ,   ⁓,    ,    ,    `
  static const grenade = SpinnerData(
    interval: 80,
    frames: [
      "،  ",
      "′  ",
      " ´ ",
      " ‾ ",
      "  ⸌",
      "  ⸊",
      "  |",
      "  ⁎",
      "  ⁕",
      " ෴ ",
      "  ⁓",
      "   ",
      "   ",
      "   "
    ],
  );

  /// point spinner, using the following sequence:
  ///
  /// `∙∙∙, ●∙∙, ∙●∙, ∙∙●, ∙∙∙`
  static const point = SpinnerData(
    interval: 125,
    frames: ["∙∙∙", "●∙∙", "∙●∙", "∙∙●", "∙∙∙"],
  );

  /// layer spinner, using the following sequence:
  ///
  /// `-, =, ≡`
  static const layer = SpinnerData(
    interval: 150,
    frames: ["-", "=", "≡"],
  );

  /// betaWave spinner, using the following sequence:
  ///
  /// `ρββββββ, βρβββββ, ββρββββ, βββρβββ, ββββρββ, βββββρβ, ββββββρ`
  static const betaWave = SpinnerData(
    interval: 80,
    frames: [
      "ρββββββ",
      "βρβββββ",
      "ββρββββ",
      "βββρβββ",
      "ββββρββ",
      "βββββρβ",
      "ββββββρ"
    ],
  );

  /// fingerDance spinner, using the following sequence:
  ///
  /// `🤘 , 🤟 , 🖖 , ✋ , 🤚 , 👆 `
  static const fingerDance = SpinnerData(
    interval: 160,
    frames: ["🤘 ", "🤟 ", "🖖 ", "✋ ", "🤚 ", "👆 "],
  );

  /// fistBump spinner, using the following sequence:
  ///
  /// `🤜　　　　🤛 , 🤜　　　　🤛 , 🤜　　　　🤛 , 　🤜　　🤛　 , 　　🤜🤛　　 , 　🤜✨🤛　　 , 🤜　✨　🤛　 `
  static const fistBump = SpinnerData(
    interval: 80,
    frames: [
      "🤜　　　　🤛 ",
      "🤜　　　　🤛 ",
      "🤜　　　　🤛 ",
      "　🤜　　🤛　 ",
      "　　🤜🤛　　 ",
      "　🤜✨🤛　　 ",
      "🤜　✨　🤛　 "
    ],
  );

  /// soccerHeader spinner, using the following sequence:
  ///
  /// ` 🧑⚽️       🧑 , 🧑  ⚽️      🧑 , 🧑   ⚽️     🧑 , 🧑    ⚽️    🧑 , 🧑     ⚽️   🧑 , 🧑      ⚽️  🧑 , 🧑       ⚽️🧑  , 🧑      ⚽️  🧑 , 🧑     ⚽️   🧑 , 🧑    ⚽️    🧑 , 🧑   ⚽️     🧑 , 🧑  ⚽️      🧑 `
  static const soccerHeader = SpinnerData(
    interval: 80,
    frames: [
      " 🧑⚽️       🧑 ",
      "🧑  ⚽️      🧑 ",
      "🧑   ⚽️     🧑 ",
      "🧑    ⚽️    🧑 ",
      "🧑     ⚽️   🧑 ",
      "🧑      ⚽️  🧑 ",
      "🧑       ⚽️🧑  ",
      "🧑      ⚽️  🧑 ",
      "🧑     ⚽️   🧑 ",
      "🧑    ⚽️    🧑 ",
      "🧑   ⚽️     🧑 ",
      "🧑  ⚽️      🧑 "
    ],
  );

  /// mindblown spinner, using the following sequence:
  ///
  /// `😐 , 😐 , 😮 , 😮 , 😦 , 😦 , 😧 , 😧 , 🤯 , 💥 , ✨ , 　 , 　 , 　 `
  static const mindblown = SpinnerData(
    interval: 160,
    frames: [
      "😐 ",
      "😐 ",
      "😮 ",
      "😮 ",
      "😦 ",
      "😦 ",
      "😧 ",
      "😧 ",
      "🤯 ",
      "💥 ",
      "✨ ",
      "　 ",
      "　 ",
      "　 "
    ],
  );

  /// speaker spinner, using the following sequence:
  ///
  /// `🔈 , 🔉 , 🔊 , 🔉 `
  static const speaker = SpinnerData(
    interval: 160,
    frames: ["🔈 ", "🔉 ", "🔊 ", "🔉 "],
  );

  /// orangePulse spinner, using the following sequence:
  ///
  /// `🔸 , 🔶 , 🟠 , 🟠 , 🔶 `
  static const orangePulse = SpinnerData(
    interval: 100,
    frames: ["🔸 ", "🔶 ", "🟠 ", "🟠 ", "🔶 "],
  );

  /// bluePulse spinner, using the following sequence:
  ///
  /// `🔹 , 🔷 , 🔵 , 🔵 , 🔷 `
  static const bluePulse = SpinnerData(
    interval: 100,
    frames: ["🔹 ", "🔷 ", "🔵 ", "🔵 ", "🔷 "],
  );

  /// orangeBluePulse spinner, using the following sequence:
  ///
  /// `🔸 , 🔶 , 🟠 , 🟠 , 🔶 , 🔹 , 🔷 , 🔵 , 🔵 , 🔷 `
  static const orangeBluePulse = SpinnerData(
    interval: 100,
    frames: [
      "🔸 ",
      "🔶 ",
      "🟠 ",
      "🟠 ",
      "🔶 ",
      "🔹 ",
      "🔷 ",
      "🔵 ",
      "🔵 ",
      "🔷 "
    ],
  );

  /// timeTravel spinner, using the following sequence:
  ///
  /// `🕛 , 🕚 , 🕙 , 🕘 , 🕗 , 🕖 , 🕕 , 🕔 , 🕓 , 🕒 , 🕑 , 🕐 `
  static const timeTravel = SpinnerData(
    interval: 100,
    frames: [
      "🕛 ",
      "🕚 ",
      "🕙 ",
      "🕘 ",
      "🕗 ",
      "🕖 ",
      "🕕 ",
      "🕔 ",
      "🕓 ",
      "🕒 ",
      "🕑 ",
      "🕐 "
    ],
  );

  /// aesthetic spinner, using the following sequence:
  ///
  /// `▰▱▱▱▱▱▱, ▰▰▱▱▱▱▱, ▰▰▰▱▱▱▱, ▰▰▰▰▱▱▱, ▰▰▰▰▰▱▱, ▰▰▰▰▰▰▱, ▰▰▰▰▰▰▰, ▰▱▱▱▱▱▱`
  static const aesthetic = SpinnerData(
    interval: 80,
    frames: [
      "▰▱▱▱▱▱▱",
      "▰▰▱▱▱▱▱",
      "▰▰▰▱▱▱▱",
      "▰▰▰▰▱▱▱",
      "▰▰▰▰▰▱▱",
      "▰▰▰▰▰▰▱",
      "▰▰▰▰▰▰▰",
      "▰▱▱▱▱▱▱"
    ],
  );

  /// dwarfFortress spinner, using the following sequence:
  ///
  /// ` ██████£££  , ☺██████£££  , ☺██████£££  , ☺▓█████£££  , ☺▓█████£££  , ☺▒█████£££  , ☺▒█████£££  , ☺░█████£££  , ☺░█████£££  , ☺ █████£££  ,  ☺█████£££  ,  ☺█████£££  ,  ☺▓████£££  ,  ☺▓████£££  ,  ☺▒████£££  ,  ☺▒████£££  ,  ☺░████£££  ,  ☺░████£££  ,  ☺ ████£££  ,   ☺████£££  ,   ☺████£££  ,   ☺▓███£££  ,   ☺▓███£££  ,   ☺▒███£££  ,   ☺▒███£££  ,   ☺░███£££  ,   ☺░███£££  ,   ☺ ███£££  ,    ☺███£££  ,    ☺███£££  ,    ☺▓██£££  ,    ☺▓██£££  ,    ☺▒██£££  ,    ☺▒██£££  ,    ☺░██£££  ,    ☺░██£££  ,    ☺ ██£££  ,     ☺██£££  ,     ☺██£££  ,     ☺▓█£££  ,     ☺▓█£££  ,     ☺▒█£££  ,     ☺▒█£££  ,     ☺░█£££  ,     ☺░█£££  ,     ☺ █£££  ,      ☺█£££  ,      ☺█£££  ,      ☺▓£££  ,      ☺▓£££  ,      ☺▒£££  ,      ☺▒£££  ,      ☺░£££  ,      ☺░£££  ,      ☺ £££  ,       ☺£££  ,       ☺£££  ,       ☺▓££  ,       ☺▓££  ,       ☺▒££  ,       ☺▒££  ,       ☺░££  ,       ☺░££  ,       ☺ ££  ,        ☺££  ,        ☺££  ,        ☺▓£  ,        ☺▓£  ,        ☺▒£  ,        ☺▒£  ,        ☺░£  ,        ☺░£  ,        ☺ £  ,         ☺£  ,         ☺£  ,         ☺▓  ,         ☺▓  ,         ☺▒  ,         ☺▒  ,         ☺░  ,         ☺░  ,         ☺   ,         ☺  &,         ☺ ☼&,        ☺ ☼ &,        ☺☼  &,       ☺☼  & ,       ‼   & ,      ☺   &  ,     ‼    &  ,    ☺    &   ,   ‼     &   ,  ☺     &    , ‼      &    ,       &     ,       &     ,      &   ░  ,      &   ▒  ,     &    ▓  ,     &    £  ,    &    ░£  ,    &    ▒£  ,   &     ▓£  ,   &     ££  ,  &     ░££  ,  &     ▒££  , &      ▓££  , &      £££  ,       ░£££  ,       ▒£££  ,       ▓£££  ,       █£££  ,      ░█£££  ,      ▒█£££  ,      ▓█£££  ,      ██£££  ,     ░██£££  ,     ▒██£££  ,     ▓██£££  ,     ███£££  ,    ░███£££  ,    ▒███£££  ,    ▓███£££  ,    ████£££  ,   ░████£££  ,   ▒████£££  ,   ▓████£££  ,   █████£££  ,  ░█████£££  ,  ▒█████£££  ,  ▓█████£££  ,  ██████£££  ,  ██████£££  `
  static const dwarfFortress = SpinnerData(
    interval: 80,
    frames: [
      " ██████£££  ",
      "☺██████£££  ",
      "☺██████£££  ",
      "☺▓█████£££  ",
      "☺▓█████£££  ",
      "☺▒█████£££  ",
      "☺▒█████£££  ",
      "☺░█████£££  ",
      "☺░█████£££  ",
      "☺ █████£££  ",
      " ☺█████£££  ",
      " ☺█████£££  ",
      " ☺▓████£££  ",
      " ☺▓████£££  ",
      " ☺▒████£££  ",
      " ☺▒████£££  ",
      " ☺░████£££  ",
      " ☺░████£££  ",
      " ☺ ████£££  ",
      "  ☺████£££  ",
      "  ☺████£££  ",
      "  ☺▓███£££  ",
      "  ☺▓███£££  ",
      "  ☺▒███£££  ",
      "  ☺▒███£££  ",
      "  ☺░███£££  ",
      "  ☺░███£££  ",
      "  ☺ ███£££  ",
      "   ☺███£££  ",
      "   ☺███£££  ",
      "   ☺▓██£££  ",
      "   ☺▓██£££  ",
      "   ☺▒██£££  ",
      "   ☺▒██£££  ",
      "   ☺░██£££  ",
      "   ☺░██£££  ",
      "   ☺ ██£££  ",
      "    ☺██£££  ",
      "    ☺██£££  ",
      "    ☺▓█£££  ",
      "    ☺▓█£££  ",
      "    ☺▒█£££  ",
      "    ☺▒█£££  ",
      "    ☺░█£££  ",
      "    ☺░█£££  ",
      "    ☺ █£££  ",
      "     ☺█£££  ",
      "     ☺█£££  ",
      "     ☺▓£££  ",
      "     ☺▓£££  ",
      "     ☺▒£££  ",
      "     ☺▒£££  ",
      "     ☺░£££  ",
      "     ☺░£££  ",
      "     ☺ £££  ",
      "      ☺£££  ",
      "      ☺£££  ",
      "      ☺▓££  ",
      "      ☺▓££  ",
      "      ☺▒££  ",
      "      ☺▒££  ",
      "      ☺░££  ",
      "      ☺░££  ",
      "      ☺ ££  ",
      "       ☺££  ",
      "       ☺££  ",
      "       ☺▓£  ",
      "       ☺▓£  ",
      "       ☺▒£  ",
      "       ☺▒£  ",
      "       ☺░£  ",
      "       ☺░£  ",
      "       ☺ £  ",
      "        ☺£  ",
      "        ☺£  ",
      "        ☺▓  ",
      "        ☺▓  ",
      "        ☺▒  ",
      "        ☺▒  ",
      "        ☺░  ",
      "        ☺░  ",
      "        ☺   ",
      "        ☺  &",
      "        ☺ ☼&",
      "       ☺ ☼ &",
      "       ☺☼  &",
      "      ☺☼  & ",
      "      ‼   & ",
      "     ☺   &  ",
      "    ‼    &  ",
      "   ☺    &   ",
      "  ‼     &   ",
      " ☺     &    ",
      "‼      &    ",
      "      &     ",
      "      &     ",
      "     &   ░  ",
      "     &   ▒  ",
      "    &    ▓  ",
      "    &    £  ",
      "   &    ░£  ",
      "   &    ▒£  ",
      "  &     ▓£  ",
      "  &     ££  ",
      " &     ░££  ",
      " &     ▒££  ",
      "&      ▓££  ",
      "&      £££  ",
      "      ░£££  ",
      "      ▒£££  ",
      "      ▓£££  ",
      "      █£££  ",
      "     ░█£££  ",
      "     ▒█£££  ",
      "     ▓█£££  ",
      "     ██£££  ",
      "    ░██£££  ",
      "    ▒██£££  ",
      "    ▓██£££  ",
      "    ███£££  ",
      "   ░███£££  ",
      "   ▒███£££  ",
      "   ▓███£££  ",
      "   ████£££  ",
      "  ░████£££  ",
      "  ▒████£££  ",
      "  ▓████£££  ",
      "  █████£££  ",
      " ░█████£££  ",
      " ▒█████£££  ",
      " ▓█████£££  ",
      " ██████£££  ",
      " ██████£££  "
    ],
  );
}
